'''Числовая цепочка. Напишите программу, которая выводит числа от 1 до 5 включительно,
разделяя их символами “---”. Используйте параметр sep.
Пример вывода:
1---2---3---4---5'''
print(1, 2, 3, 4, 5, sep="---")

print("1", "2", "3", "4", "5", sep="---")