'''Текст в кавычках. Напишите программу, которая выводит строку "Это файл "example.txt"".
Выполните задачу несколькими способами.
Пример вывода:
Это файл "example.txt"'''
print('''Это файл "example.txt"''')
print('Это файл "example.txt"')
print("Это файл \"example.txt\"")