'''Пробельные символы. Напишите программу, которая выведет две строки: первая строка с
табуляцией, вторая — на новой строке с помощью одного вызова print().
Пример вывода:
  Первая строка с табуляцией
Вторая строка на новой строке'''
print("\tПервая строка с табуляцией\nВторая строка на новой строке")

# вариант 2
first_line = '\tПервая строка с табуляцией'
second_line = '\nВторая строка на новой строке'
print (first_line, second_line)