'''Проверка на подмножество
Напишите программу, которая проверяет, содержит ли первое множество все элементы второго множества. Реализуйте решение
несколькими способами. Решите одним из способов не используя возможности множеств.
Данные:
set1 = {1, 2, 3, 4}
set2 = {2, 3}
Пример вывода:
True'''
set1 = {1, 2, 3, 4}
set2 = {2, 3}
print(set2 <= set1)

print(set1 >= set2)

list1 = list(set1)
list2 = list(set2)
short_list = []
long_list = []
if len(list1) > len(list2):
    short_list = list2
    long_list = list1
else:
    short_list = list1
    long_list = list2
count = 0
for i in range(len(short_list)):
    if short_list[i] in long_list:
        count += 1
    else:
        print("False")
if count == len(short_list):
    print("True")

'''Зеркальное подмножество
Напишите программу, которая проверяет, являются ли элементы одного из множеств подмножеством другого. В случае 
положительного ответа возвращает разницу между двумя множествами. Проверить необходимо в обе стороны.
Данные:
set1 = {2, 3, 4, 5, 6}
set2 = {4, 5}
Пример вывода:
Подмножество: True
Разница: {2, 3, 6}'''
set1 = {2, 3, 4, 5, 6}
set2 = {4, 5}
if set1 <= set2:
    print("Подмножество: True")
    print(set2 - set1)
elif set2 <= set1:
    print("Подмножество: True")
    print(set1 - set2)
else:
    print("Подмножество: False")
