'''1. Класс Rectangle
Создайте класс Rectangle, который описывает прямоугольник.
● У каждого объекта должны быть два поля: width и height.
● Добавьте метод get_area(), который возвращает площадь прямоугольника.
● Создайте объект прямоугольника с произвольными значениями.
● Выведите его площадь.
● Измените ширину и высоту.
● Выведите новую площадь.
Пример вывода:
Площадь: 20
Новая площадь: 35'''
class Rectangle:
    def __init__(self, width, height):
        self.width = width
        self.height = height

    def get_area(self):
        self.area = self.width * self.height
        return self.area

rectangle = Rectangle(30, 40)
print(f"Площадь прямоугольника: ", rectangle.get_area())
rectangle.width = 20
rectangle.height = 25
print(f"Новая площадь: ", rectangle.get_area())

'''2. Класс Counter
Реализуйте класс Counter, который представляет собой простой счётчик.
● Счётчик должен начинаться с нуля.
● Предусмотрите методы для увеличения и уменьшения значения на единицу, при
этом при каждой операции должно отображаться новое значение счётчика.
● Добавьте метод, возвращающий текущий результат.
● Проверьте работу счётчика, выполнив несколько операций.
Пример вывода:
Значение увеличено, текущее: 1
Значение увеличено, текущее: 2
Значение увеличено, текущее: 3
Значение уменьшено, текущее: 2
Текущее значение: 2'''
class Counter:
    def __init__(self):
        self.call_count = 0

    def current_count(self):
        return self.call_count

    def incr_count(self):
        self.call_count += 1
        print("Значение увеличено, текущее:", self.call_count)

    def decr_count(self):
        self.call_count -= 1
        print("Значение уменьшено, текущее:", self.call_count)

counter = Counter()
counter.incr_count()
counter.incr_count()
counter.incr_count()
counter.decr_count()
print("Текущее значение:", counter.current_count())