'''1. Фабрика функций округления
Создайте функцию make_rounder(), которая принимает количество знаков для округления и возвращает другую функцию.
Полученная функция должна принимать число и возвращать его, округлённое до указанного ранее количества знаков после
запятой.
Пример вызова:
print(round2(3.14159))
print(round2(2.71828))
print(round0(9.999))
Пример вывода:
3.14
2.72
10.0'''
def make_rounder(cnt):
    def wrapper(num):
        return round(num, cnt)
    return wrapper

round2 = make_rounder(2)
round0 = make_rounder(0)

print(round2(3.14159))
print(round2(2.71828))
print(round0(9.999))


'''2. Расширяемый логгер событий
Создайте функцию, которая возвращает вложенный логгер событий.
Каждый вызов логгера должен сохранять событие с текущим временем (если оно передано) и возвращать весь список событий.
Пример вызова: 
log("Загрузка данных")
log("Обработка завершена")
log("Сохранение файла")
for event in log():
    print(event)
Пример вывода:
Загрузка данных: 2025-03-24 14:06:29
Обработка завершена: 2025-03-24 14:06:29
Сохранение файла: 2025-03-24 14:06:29'''
from datetime import datetime


def new_logger():
    log_events = []

    def log(message=None):
        if message is not None:
            cur_time = datetime.now().strftime("%Y-%m-%d %H:%M:%S")
            log_events.append(f"{message}: {cur_time}")
        return log_events

    return log

log = new_logger()

log("Загрузка данных")
log("Обработка завершена")
log("Сохранение файла")
for item in log():
    print(item)

'''Рамка вокруг вывода
Создайте декоратор frame, который оборачивает результат функции рамкой из 50 символов -, выводя по строке до и после вызова функции.
Пример декорируемой функции: 
def say_hello():
    print("Привет, игрок!")
Пример вывода: 
--------------------------------------------------
Привет, игрок!
--------------------------------------------------'''
def framed(func):
    def wrapper():
        print('-' * 50)
        func()
        print('-' * 50)
    return wrapper

@framed
def say_hello():
    print("Привет, игрок!")

say_hello()