'''Напишите программу, которая выводит на экран следующую строку несколькими способами:
Она сказала: "Привет!"
Пример вывода:
Она сказала: "Привет!"
Она сказала: "Привет!"
Она сказала: "Привет!"'''

str = 'Она сказала: "Привет!"\n'
print(str * 3)

# альтернативный вариант
print("Она сказала: \"Привет!\"")
print('Она сказала: "Привет!"')
print("""Она сказала: "Привет!\"""")

'''Напишите программу, которая выводит следующий текст:
Пример вывода:
Список дел:
    Учеба
    Уборка
    Спорт'''
print("Список дел:\n\tУчеба\n\tУборка\n\tСпорт")