# -*- coding: utf-8 -*-
"""Summary_18.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1H4IFr3RYMc66vInnc_k8ekTwnJwEcCTO

## Python Fundamentals 2025: Домашнее задание 34

### 1. **Класс Rectangle**

Создайте класс `Rectangle`, который описывает прямоугольник.

- У каждого объекта должны быть два поля: `width` и `height`.  
- Добавьте метод `get_area()`, который возвращает площадь прямоугольника.  
- Создайте объект прямоугольника с произвольными значениями.  
- Выведите его площадь.  
- Измените ширину и высоту.  
- Выведите новую площадь.  

**Пример вывода:**
```
Площадь: 20
Новая площадь: 35
```
"""

class Rectangle:
    def __init__(self, width, height):
        self.width = width
        self.height = height

    def get_area(self):
        return self.width * self.height

r = Rectangle(4, 5)
print("Площадь:", r.get_area())

r.width = 5
r.height = 7
print("Новая площадь:", r.get_area())

"""### 2. **Класс Counter**

Реализуйте класс `Counter`, который представляет собой простой счётчик.

- Счётчик должен начинаться с нуля.  
- Предусмотрите методы для увеличения и уменьшения значения на единицу, при этом при каждой операции должно отображаться новое значение счётчика.  
- Добавьте метод, возвращающий текущий результат.  
- Проверьте работу счётчика, выполнив несколько операций.

**Пример вывода:**
```
Значение увеличено, текущее: 1
Значение увеличено, текущее: 2
Значение увеличено, текущее: 3
Значение уменьшено, текущее: 2
Текущее значение: 2
```

"""

class Counter:
    def __init__(self, value=0):
        self.value = value

    def increment(self):
        self.value += 1
        print(f"Значение увеличено, текущее: {self.value}")

    def decrement(self):
        self.value -= 1
        print(f"Значение уменьшено, текущее: {self.value}")

    def get(self):
        return self.value

c = Counter()
print(f"Текущее значение: {c.get()}")
c.increment()
c.increment()
c.increment()
c.decrement()
print(f"Текущее значение: {c.get()}")

"""## Python Fundamentals 2025: Домашнее задание 35

### 1. **Счётчик экземпляров**

Создайте класс `User`, представляющий пользователя.

- При создании должны указываться логин (`username`) и пароль (`password`).  
- У класса должно быть поле `total_users`, хранящее общее количество созданных пользователей.  
- При каждом создании нового объекта `User`, счётчик должен увеличиваться.  
- Добавьте метод `get_total()`, возвращающий количество пользователей.  
- Проверьте, что счётчик работает.

**Пример вывода:**
```
Total users: 2
```
"""

class User:
    total_users = 0

    def __init__(self, username, password):
        self.username = username
        self.password = password
        User.total_users += 1

    @classmethod
    def get_total(cls):
        return cls.total_users

u1 = User("alice", "secret")
u2 = User("bob", "qwe")
u2 = User("bob", "pass")

print(f"Total users: {User.get_total()}")

"""### 2. **Проверка данных пользователя**

Доработайте класс `User`.

- Добавьте валидации полей при создании.
- Имя должно быть непустой строкой.  
- Пароль должен быть строкой длиной не менее 5 символов.  
- Если данные некорректны — выбрасывайте `ValueError`.  
- Добавьте строковое представление объекта.
- Проверьте работу класса с разными значениями.

**Пример вызова:**
```python
user1 = User("alice", "secret")
user2 = User("bob", "qwe")
```

**Пример вывода:**
```
User: alice
  ...
ValueError: Invalid password: 'qwe'.
```


"""

class User:
    total_users = 0

    def __init__(self, username, password):
        self.validate_username(username)
        self.validate_password(password)
        self.username = username
        self.password = password
        User.total_users += 1

    @classmethod
    def get_total(cls):
        return cls.total_users

    @staticmethod
    def validate_username(value):
        if not (isinstance(value, str) and len(value.strip()) > 0):
            raise ValueError(f"Invalid username: '{value}'.")

    @staticmethod
    def validate_password(value):
        if not (isinstance(value, str) and len(value) >= 5):
            raise ValueError(f"Invalid password: '{value}'.")


    def __str__(self):
        return f"User: {self.username}"


user1 = User("alice", "secret")
print(user1)
try:
    user2 = User("bob", "qwe")  # вызовет ошибку
except ValueError as e:
    print(e)

print(f"Total users: {User.get_total()}")