'''Пробельные символы. Напишите программу, которая выведет две строки: первая строка с
табуляцией, вторая — на новой строке с помощью одного вызова print().
Пример вывода:
  Первая строка с табуляцией
Вторая строка на новой строке'''
print("\tПервая строка с табуляцией\nВторая строка на новой строке")