# -*- coding: utf-8 -*-
"""Summary_15.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1kJeMQZAQArsG9__tfXI3KOP3tCCSCee6

## Python Fundamentals 2025: Домашнее задание 28

### 1. План по дням недели

Напишите программу, которая помогает планировать дела.
Программа должна бесконечно выводить план на следующий день недели, пока пользователь нажимает 'Enter'.

Данные:

weekly_schedule = {

    "Monday": ["Gym", "Work", "Read book"],

    "Tuesday": ["Meeting", "Work", "Study Python"],

    "Wednesday": ["Shopping", "Work", "Watch movie"],

    "Thursday": ["Work", "Call parents", "Play guitar"],

    "Friday": ["Work", "Dinner with friends"],

    "Saturday": ["Hiking", "Rest"],

    "Sunday": ["Family time", "Rest"]

}

Пример ввода:

Нажмите 'Enter' для получения плана:

Monday: Gym, Work, Read book

Нажмите 'Enter' для получения плана:

Tuesday: Meeting, Work, Study Python

...

Нажмите 'Enter' для получения плана:

Sunday: Family time, Rest

Нажмите 'Enter' для получения плана:

Monday: Gym, Work, Read book

Нажмите 'Enter' для получения плана: q

...
"""

from itertools import cycle

weekly_schedule = {
    "Monday": ["Gym", "Work", "Read book"],
    "Tuesday": ["Meeting", "Work", "Study Python"],
    "Wednesday": ["Shopping", "Work", "Watch movie"],
    "Thursday": ["Work", "Call parents", "Play guitar"],
    "Friday": ["Work", "Dinner with friends"],
    "Saturday": ["Hiking", "Rest"],
    "Sunday": ["Family time", "Rest"]
}
day_cycle = cycle(weekly_schedule.items())
while True:
    user_input = input("Нажмите 'Enter' для получения плана или q для выхода :")
    if user_input == "q":
        break
    elif not user_input:
        day, tasks = next(day_cycle)
        print(f"{day}: {', '.join(tasks)}")
    else:
        print("Некорректный ввод. Пожалуйста, нажмите 'Enter' для получения плана.")

iterator = iter(weekly_schedule.items())

while True:
    input("Нажмите 'Enter' для получения плана: ")

    try:
        day, tasks = next(iterator)
    except StopIteration:
        iterator = iter(weekly_schedule.items())
        day, tasks = next(iterator)

    print(f"{day}: {', '.join(tasks)}")

"""### 2. Объединение списков продуктов

Напишите функцию, которая принимает несколько списков с названиями продуктов и возвращает генератор, содержащий все продукты в нижнем регистре.
Выведите содержимое генератора.

Данные:

fruits = ["Apple", "Banana", "Orange"]

vegetables = ["Carrot", "Tomato", "Cucumber"]

dairy = ["Milk", "Cheese", "Yogurt"]

Пример вывода:

apple

banana

orange

carrot

tomato

cucumber

milk

cheese

yogurt
"""

import itertools

def merge_products(*product_lists):
    return (item.lower() for item in itertools.chain(*product_lists))
    # yield from (item.lower() for item in itertools.chain(*product_lists))

fruits = ["Apple", "Banana", "Orange"]
vegetables = ["Carrot", "Tomato", "Cucumber"]
dairy = ["Milk", "Cheese", "Yogurt"]

merged_iterator = merge_products(fruits, vegetables, dairy)
print(merged_iterator)

for product in merged_iterator:
    print(product)

fruits = ["Apple", "Banana", "Orange"]
vegetables = ["Carrot", "Tomato", "Cucumber"]
dairy = ["Milk", "Cheese", "Yogurt"]

def join_products(*lists):
    return (item.lower() for value in lists for item in value)

products = join_products(fruits, vegetables, dairy)

for p in products:
    print(p)

"""### 3. Комбинации одежды

Напишите функцию, которая принимает списки типов одежды, цветов и размеров, а затем генерирует все возможные комбинации
в формате "Clothe - Color - Size".

Данные:

clothes = ["T-shirt", "Jeans", "Jacket"]

colors = ["Red", "Blue", "Black"]

sizes = ["S", "M", "L"]

Пример вывода:

T-shirt - Red - S

T-shirt - Red - M

T-shirt - Red - L

T-shirt - Blue - S

...

Jacket - Black - L
"""

import itertools

def generate_outfits(clothes, colors, sizes):
    return (" - ".join(comb) for comb in itertools.product(clothes, colors, sizes))

# Данные
clothes = ["T-shirt", "Jeans", "Jacket"]
colors = ["Red", "Blue", "Black"]
sizes = ["S", "M", "L"]

outfit_iterator = generate_outfits(clothes, colors, sizes)

# Выводим комбинации
for outfit in outfit_iterator:
    print(outfit)

"""## Python Fundamentals 2025: Домашнее задание 29

### 1. Генератор Фибоначчи

Создайте генератор, который генерирует последовательность Фибоначчи бесконечно,
возвращая по одному числу за раз.

Последовательность Фибоначчи — это ряд чисел, где каждое следующее число равно сумме двух предыдущих.
Начинается с 0 и 1.

Пример вывода:

0

1

1

2

3

5

8

13

21

34
"""

def fibonacci():
    a, b = 0, 1
    while True:
        yield a
        a, b = b, a + b

        # incorrect
        # a = b
        # b = a + b

        # c = b
        # b = a + b
        # a = c

gen = fibonacci()

for _ in range(10):
    print(next(gen))

"""### 2. Генератор уникальных элементов

Создайте генератор, который принимает список элементов и выдаёт только уникальные значения,
сохраняя порядок их появления в исходном списке.

Данные:

data = [3, 1, 2, 3, 4, 1, 5, 2, 6, 7, 5, 8]

Пример вывода:

3

1

2

4

5

6

7

8
"""

def unique_elements(sequence):
    seen = set()
    for item in sequence:
        if item not in seen:
            seen.add(item)
            yield item

# Исходные данные
data = [3, 1, 2, 3, 4, 1, 5, 2, 6, 7, 5, 8]

gen = unique_elements(data)

for num in gen:
    print(num)