# -*- coding: utf-8 -*-
"""Summary_14.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1dXybPh9_b0hcLU0vpLVKbBRIRpzqQUL5

## Python Fundamentals 2025: Домашнее задание 26

### 1. Список файлов и папок

Напишите программу, которая принимает путь к директории через аргумент командной строки и выводит:

Отдельно список папок

Отдельно список файлов

Пример запуска

python script.py /home/user/documents

Пример вывода

Содержимое директории '/home/user/documents':


Папки:

- folder1

- folder2


Файлы:

- file1.txt

- file2.txt

- notes.docx
"""

import os
import sys

# Проверяем, передан ли аргумент
if len(sys.argv) != 2:
    print("Использование: python script.py <путь_к_директории>")
    sys.exit(1)

dir_path = sys.argv[1]

# Проверяем существование директории
if not os.path.exists(dir_path) or not os.path.isdir(dir_path):
    print(f"Ошибка: Директория '{dir_path}' не найдена.")
    sys.exit(1)

# Разделяем файлы и папки
folders = []
files = []

for item in os.listdir(dir_path):
    full_path = os.path.join(dir_path, item)
    if os.path.isdir(full_path):
        folders.append(full_path)
    elif os.path.isfile(full_path):
        files.append(full_path)

print(f"\nСодержимое директории '{dir_path}':")

if folders:
    print("\n Папки:")
    for folder in sorted(folders):
        print("-", folder)
if files:
    print("\n Файлы:")
    for file in sorted(files):
        print("-", file)

"""### 2. Поиск и удаление файлов с указанным расширением

Напишите программу, которая:

Принимает путь к директории и расширение файлов через аргумент командной строки.

Рекурсивно ищет файлы с этим расширением во всех вложенных папках.

Спрашивает у пользователя, хочет ли он удалить найденные файлы.

Если пользователь подтверждает, удаляет их.

Пример запуска:

python script.py /home/user/PycharmProjects/project1 .log

Пример вывода

Найдены файлы с расширением '.log':

- logs/error.log

- logs/system.log

- logs/backup/old.log

- logs/backup/debug.log


Вы хотите удалить эти файлы? (y/n): y

Удаление завершено.
"""

import os
import sys

# Проверяем, передан ли аргумент
if len(sys.argv) != 3:
    print("Использование: python script.py <путь к папке> <расширение>")
    sys.exit(1)

path_to_folder = sys.argv[1]
extension = sys.argv[2]
found_files = []

# Рекурсивный поиск файлов
for root, _, files in os.walk(path_to_folder):
    for file in files:
        if file.endswith(extension):
            found_files.append(os.path.join(root, file))

# Если файлов нет, завершаем программу
if not found_files:
    print(f"Файлы с расширением '{extension}' не найдены.")
    sys.exit(0)

# Выводим список файлов
print(f"Найдены файлы с расширением '{extension}':")
for file in found_files:
    print("-", file)

# Спрашиваем у пользователя, хочет ли он их удалить
confirm = input("\nВы хотите удалить эти файлы? (y/n): ")
if confirm.lower() == "y":
    # Удаляем файлы
    for file in found_files:
        os.remove(file)
    print("Удаление завершено.")
else:
    print("Удаление отменено.")

"""## Python Fundamentals 2025: Домашнее задание 27

### 1. Фильтрация по ключевому слову

Напишите программу, которая ищет в файле все строки, содержащие указанное пользователем слово, и сохраняет их в новый файл.

Имя нового файла формируется как `<keyword>_<original_filename>`.

Если файл не существует, программа должна вывести ошибку.

Если совпадения не найдены, новый файл не создаётся.

Используйте файл system_log.txt.

Пример ввода:

Введите имя файла для поиска: system_log.txt

Введите ключевое слово: error

Пример вывода:

Строки, содержащие 'error', сохранены в error_system_log.txt.
"""

import os

input_filename = input("Введите имя файла для поиска: ")
keyword = input("Введите ключевое слово: ").lower()
# Формирование имени выходного файла
dir_name, base_name = os.path.split(input_filename)
output_filename = os.path.join(dir_name, f"{keyword}_{base_name}")


try:
    with open(input_filename, "r", encoding="utf-8") as infile:
        matched_lines = [line for line in infile if keyword in line.lower()]

        if matched_lines:
            with open(output_filename, "w", encoding="utf-8") as outfile:
                outfile.writelines(matched_lines)

            print(f"Строки, содержащие '{keyword}', сохранены в '{output_filename}'.")
        else:
            print(f"Совпадений с '{keyword}' не найдено. Файл не создан.")

except FileNotFoundError:
    print(f"Ошибка: Файл '{input_filename}' не найден.")

"""### 2. Поиск и удаление дубликатов

Напишите программу, которая удаляет дублирующиеся строки из файла и сохраняет результат в новый файл.

Имя нового файла формируется как `unique_<original_filename>`.

Если файл не существует, программа должна вывести ошибку.

Исходный порядок строк должен сохраниться.

Если в файле нет дубликатов, создаётся точная копия файла.

Используйте файл movies_to_watch.txt.

Пример ввода:

Введите имя файла: movies_to_watch.txt

Пример вывода:

Дубликаты удалены. Уникальные строки сохранены в unique_movies_to_watch.txt.
"""

import os

input_filename = input("Введите имя файла: ")
dir_name, base_name = os.path.split(input_filename)
output_filename = os.path.join(dir_name, f"unique_{base_name}")

try:
    with (open(input_filename, "r", encoding="utf-8") as infile,
          open(output_filename, "w", encoding="utf-8") as outfile):
        seen = set()
        for line in infile:
            if line not in seen:
                seen.add(line)
                outfile.write(line)
        print(f"Дубликаты удалены. Уникальные строки сохранены в '{output_filename}'.")
except FileNotFoundError:
    print(f"Ошибка: Файл '{input_filename}' не найден.")