# -*- coding: utf-8 -*-
"""Summary_16.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1zBuN9fPb0mgiissynWXG723EO2BpSCws

## Python Fundamentals 2025: Домашнее задание 30

### 1. Анализ курсов студентов

Реализовать программу, которая должна:

Прочитать файл student_courses.json, содержащий:

имя,

дату рождения (birth_date) в формате дд.мм.гггг,

дату поступления (enrollment_date) в том же формате,

список курсов.

Вычислить:

Общее количество студентов.

Средний возраст на момент поступления.

Количество студентов на каждом курсе.

Сохранить отчёт в JSON-файл student_courses_report.json.

Данные:

[

  {"name": "Diana Williams", "birth_date": "12.06.1983", "enrollment_date": "29.04.2023", "courses": ["Physics", "Chemistry"]},

  {"name": "Tina Miller", "birth_date": "06.07.2004", "enrollment_date": "18.04.2020", "courses": ["Biology", "Business"]},

  {"name": "Kevin Miller", "birth_date": "20.12.2004", "enrollment_date": "16.12.2020", "courses": ["Linguistics", "Math", "History"]},

  {"name": "Fiona Brown", "birth_date": "05.07.1999", "enrollment_date": "02.09.2022", "courses": ["Art", "Philosophy"]},

  {"name": "Charlie Davis", "birth_date": "17.07.1998", "enrollment_date": "17.05.2023", "courses": ["Chemistry", "Physics", "Business"]},

  {"name": "Diana Jones", "birth_date": "24.12.1980", "enrollment_date": "26.11.2021", "courses": ["Economics", "Linguistics"]},

  {"name": "Alice Johnson", "birth_date": "22.09.1981", "enrollment_date": "23.12.2020", "courses": ["Chemistry", "Economics", "Math"]},

  {"name": "Ian Lopez", "birth_date": "23.11.2001", "enrollment_date": "07.05.2020", "courses": ["Philosophy", "Art", "Physics"]},

  {"name": "Kevin Davis", "birth_date": "30.01.1997", "enrollment_date": "20.03.2021", "courses": ["Math", "Economics"]},

  ...

]

Пример вывода (student_courses_report.json):

{

    "total_students": 100,

    "average_enrollment_age": 27.9,

    "students_per_course": {

        "Art": 21,

        "Biology": 18,

        "Business": 28,

        "Chemistry": 16,

        "Economics": 23,

        "History": 9,

        "Linguistics": 23,

        "Math": 23,

        "Philosophy": 19,

        "Physics": 19

    }

}
"""

import json
from datetime import datetime
from collections import defaultdict

def calculate_age(birth_date_str, ref_date_str=None):
    birth_date = datetime.strptime(birth_date_str, "%d.%m.%Y")
    if ref_date_str:
        ref_date = datetime.strptime(ref_date_str, "%d.%m.%Y")
    else:
        ref_date = datetime.today()
    age = ref_date.year - birth_date.year
    if (ref_date.month, ref_date.day) < (birth_date.month, birth_date.day):
        age -= 1
    return age

# Чтение данных
with open("student_courses.json", "r", encoding="utf-8") as file:
    students = json.load(file)

total = len(students)
ages_on_enroll = []
course_counts = defaultdict(int)

for student in students:
    birth = student["birth_date"]
    enroll = student["enrollment_date"]
    ages_on_enroll.append(calculate_age(birth, enroll))
    for course in student["courses"]:
        course_counts[course] += 1

report = {
    "total_students": total,
    "average_enrollment_age": round(sum(ages_on_enroll) / total, 1),
    "students_per_course": dict(sorted(course_counts.items()))
}

with open("student_courses_report.json", "w", encoding="utf-8") as file:
    json.dump(report, file, ensure_ascii=False, indent=4)

"""## Python Fundamentals 2025: Домашнее задание 31

### 1. Извлечение дат

Реализуйте программу, которая должна:

Найти в тексте все даты в форматах DD/MM/YYYY, DD-MM-YYYY и DD.MM.YYYY.

Данные:

text = "The events N 123456 happened on 15/03/2025, 01.12.2024 and 09-09-2023. Deadline: 28/02/2022."

Пример вывода:

15/03/2025  
01.12.2024  
09-09-2023  
28/02/2022
"""

import re

text = "The events N 01,02,1000 happened on 15/03-2025, 01.12.2024 and 09-09-2023. Deadline: 28\02\2022."

pattern = r"\b\d{2}[-/.]\d{2}[-/.]\d{4}\b"
dates = re.findall(pattern, text)

for d in dates:
    print(d)

"""### 2. Разделение списка тегов

Реализуйте программу, которая должна:

- Прочитать строку с тегами, введёнными пользователем.

- Разделить её на отдельные теги, независимо от того, чем они были разделены (запятые, точки с запятой, слэши или пробелы).

- Удалить лишние пробелы и пустые значения.

Данные:

tag_input = "python, data-science / machine-learning; AI  neural-networks"


Пример вывода:

['python', 'data-science', 'machine-learning', 'AI', 'neural-networks']
"""

import re

tag_input = "python, data-science / machine-learning; AI  neural-networks;"

# Разделение по , ; / и пробелам (один или несколько подряд)
raw_tags = re.split(r"[\s,;/]+", tag_input)

print(raw_tags)

# Удаляем пустые элементы и лишние пробелы
tags = [tag.strip() for tag in raw_tags if tag.strip()]

print(tags)